# IIC1005: Ayudantía 1

#### 14 de marzo de 2018.

###### Esta ayudantía está inspirada en la Ayudantía 2 de la versión 2017-2 de este curso. Puedes encontrar la original [aquí](https://github.com/diflores/iic1005-ayudantia-2).

## *Jupyter notebooks*

**¿Qué es un *notebook*?**

Un *notebook* es un documento generado por la *Jupyter Notebook App*. Estos documentos contienen código ejecutable y también elementos más amigables para el ser humano común, tales como párrafos, ecuaciones e hipervínculos. Estas características convierten a los *notebooks* en herramientas ideales para aprender Python, procesar datos y aventurarse *machine learning*.

Los *notebooks* se componen de una serie de celdas, que pueden ser de distintos tipos. Por lo general, utilizaremos solo dos:

- Code (para escribir código ejecutable).
- [*Markdown*](https://guides.github.com/features/mastering-markdown/) (para escribir párrafos en dicho lenguage de marcación).

La celda actual es una celda de tipo *markdown*. La siguiente, corresponde a una de tipo *code*. Puedes ejecutar su código presionando el ícono ▶️:

In [1]:
print("¡Hola mundo!")

¡Hola mundo!

También puedes ejecutar el código de una celda presionando shift + enter, lo que ejecutará el código y avanzará a la celda siguiente. Si deseas ejecutar el código, pero mantenerte en la celda correspondiente, utiliza ctrl + enter. Si quieres aprender más atajos de teclado, presiona esc + h

## Pandas

**¿Qué es pandas?**

Pandas es una librería de Python que nos permitirá manipular datos de manera sencilla.

**¿Por qué no utilizamos las estructuras de datos de Python para esto?**

Porque aun cuando sirvan para solucionar el problema, su uso en esta misión no es eficiente. 

### Conceptos básicos de pandas: *Series* y *DataFrames*

Pandas cuenta con dos estructuras de datos principales, las *Series* y los *DataFrames*. Una Series puede ser comprendida como una columna de datos. Un *DataFrame*, por su parte, puede ser visto como un conjunto de *Series*.

A continuación, revisaremos un ejemplo sencillo, que nos permitirá introducirnos al uso de pandas. Lo primero que debemos hacer es importar la librería:

In [2]:
import pandas as pd

En este ejemplo, utilizaremos un *dataset* de transacciones de enero de 2009, el que fue obtenido desde [aquí](https://support.spatialkey.com/spatialkey-sample-csv-data/). Lo primero que debemos hacer es cargar los datos. Para ello, la librería pandas provee un método muy útil llamado `read_csv`.

In [3]:
dataset = pd.read_csv("SalesJan2009.csv")

### Explorando los datos mediante preguntas *interesantes*
Antes de manipular los datos, es conveniente explorarlos. Inicialmente, podríamos preguntarnos: ¿qué columnas contiene el *dataset* recién cargado? Podemos obtener esta información ejecutando la siguiente celda:

In [4]:
dataset.columns

Index(['Transaction_date', 'Product', 'Price', 'Payment_Type', 'Name', 'City',
       'State', 'Country', 'Account_Created', 'Last_Login', 'Latitude',
       'Longitude'],
      dtype='object')

**¿Cuántas filas tiene el *dataset*?**

In [5]:
len(dataset)

998

**¿Cómo se ve el *dataset*?**

In [6]:
dataset.sample(10)

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
239,1/8/09 4:16,Product1,1200,Visa,Alan,Malahide,Dublin,Ireland,4/18/06 13:26,1/23/09 2:21,53.450833,-6.154444
55,1/11/09 2:04,Product1,1200,Visa,chris,Gold Coast,Queensland,Australia,1/11/09 0:33,1/11/09 2:11,-28.000000,153.433333
979,1/23/09 10:04,Product1,1200,Mastercard,Kevin,Hollywood,CA,United States,5/30/06 20:25,2/28/09 9:59,34.098330,-118.325830
133,1/6/09 14:03,Product1,1200,Visa,Fie,New York,NY,United States,5/1/08 8:26,1/17/09 11:44,40.714170,-74.006390
161,1/11/09 11:20,Product1,1200,Visa,Klara,Spring Lake Park,MN,United States,12/31/08 19:48,1/18/09 17:43,45.107780,-93.237780
720,1/2/09 18:41,Product1,1200,Visa,odile,Lititz,PA,United States,2/1/06 8:47,2/15/09 15:47,40.157220,-76.307220
687,1/16/09 6:04,Product1,1200,Mastercard,Alexis,Ehingen an der Donau,Baden-Wurttemberg,Germany,1/15/09 2:56,2/14/09 5:05,48.283333,9.733333
918,1/23/09 7:13,Product1,1200,Visa,Elizabeth,Hamilton,Hamilton,Bermuda,1/19/09 6:03,2/25/09 16:20,32.294167,-64.783889
756,1/2/09 15:13,Product1,1200,Visa,Rowena,Cork,Cork,Ireland,1/10/06 7:05,2/17/09 6:38,51.898611,-8.495833
480,1/30/09 20:27,Product1,1200,Mastercard,Natasha,Pasadena,CA,United States,1/30/09 20:02,2/3/09 23:39,34.147780,-118.143610

Pandas también nos permite responder preguntas un poco más interesantes como:

**¿Cuáles son las transacciones que fueron realizadas en Noruega?**

In [7]:
dataset[dataset["Country"] == "Norway"]

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
67,1/11/09 11:33,Product1,1200,Visa,Stefan,Stavanger,Rogaland,Norway,1/11/09 9:02,1/12/09 10:37,58.966667,5.750000
79,1/8/09 13:14,Product1,1200,Visa,Dr. Claudia,Oslo,Oslo,Norway,1/8/09 12:47,1/13/09 10:49,59.916667,10.750000
168,1/7/09 8:21,Product1,1200,Visa,Jannik,Holmenkollen,Oslo,Norway,1/3/09 11:06,1/19/09 6:54,59.966667,10.666667
213,1/21/09 11:36,Product1,1200,Visa,nicole,Oslo,Oslo,Norway,12/23/08 12:02,1/21/09 13:47,59.916667,10.750000
234,1/1/09 14:22,Product1,1200,Mastercard,Liban,Stavanger,Rogaland,Norway,6/19/08 10:48,1/22/09 14:38,58.966667,5.750000
262,1/10/09 3:28,Product1,1200,Visa,frauke,Horten,Vestfold,Norway,11/24/08 15:50,1/24/09 15:10,59.413611,10.466944
343,1/15/09 10:51,Product1,1200,Mastercard,Pia,Sola,Rogaland,Norway,1/11/09 8:54,1/28/09 10:39,58.883333,5.600000
387,1/11/09 14:56,Product1,1200,Visa,Nicole,Aardal,Sogn og Fjordane,Norway,1/5/09 5:51,1/31/09 4:21,61.550000,6.350000
408,1/9/09 16:35,Product1,1200,Diners,Jennifer,Nordstrand,Oslo,Norway,12/29/05 9:26,2/1/09 4:18,59.860833,10.790556
429,1/6/09 3:39,Product1,1200,Visa,Krista,Bergen,Hordaland,Norway,9/20/05 1:58,2/2/09 0:08,60.391111,5.324722
608,1/13/09 9:14,Product1,1200,Visa,sangeeta,Vossevangen,Hordaland,Norway,1/9/09 9:31,2/10/09 9:04,60.633333,6.433333
683,1/28/09 4:35,Product1,1200,Diners,Selene,Oslo,Oslo,Norway,4/5/05 5:30,2/13/09 23:15,59.916667,10.750000
831,1/25/09 8:16,Product2,3600,Visa,Astrid,Oslo,Oslo,Norway,4/22/07 2:19,2/20/09 23:22,59.916667,10.750000
897,1/19/09 10:47,Product1,1200,Mastercard,David,Stavenger,Rogaland,Norway,1/13/09 13:53,2/25/09 0:40,58.966667,5.750000
909,1/22/09 12:56,Product1,1200,Visa,Laleh,Aasgaardstrand,Vestfold,Norway,1/20/09 13:13,2/25/09 12:03,59.348889,10.467500
925,1/2/09 4:21,Product1,1200,Visa,Elaine,Tranby,Buskerud,Norway,7/30/07 11:42,2/26/09 3:18,59.816667,10.250000

**¿Cuáles son las transacciones que fueron realizadas con una tarjeta Visa en los Países Bajos?**

In [8]:
dataset[(dataset["Country"] == "Netherlands") & (dataset["Payment_Type"] == "Visa")]

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
224,1/21/09 14:25,Product1,1200,Visa,Tricia,Castricum,Noord-Holland,Netherlands,12/28/07 15:28,1/22/09 0:38,52.550000,4.666667
660,1/27/09 12:47,Product1,1200,Visa,Caterina,Amsterdam,Noord-Holland,Netherlands,1/27/09 12:03,2/12/09 12:59,52.350000,4.916667
712,1/19/09 15:40,Product2,3600,Visa,Julia,Ede,Gelderland,Netherlands,1/19/09 14:32,2/15/09 10:33,52.033333,5.666667
841,1/30/09 23:49,Product2,3600,Visa,Stephanie,Hilversum,Noord-Holland,Netherlands,11/30/08 11:54,2/21/09 14:05,52.233333,5.183333

La librería pandas nos permite resolver preguntas aun más interesantes, tales como **¿cuáles son los países con la mayor cantidad de transacciones?**. Para contestar esto, haremos uso de `group_by`, que, en palabras sencillas, nos permite agrupar las filas de un DataFrame de acuerdo a alguna(s) columna(s).

In [9]:
dataset.groupby(["Country"]).count()["Transaction_date"].sort_values(ascending=False)[0:4]

Country
United States     463
United Kingdom    100
Canada             76
Ireland            49
Name: Transaction_date, dtype: int64

Ahora queremos saber cuánto dinero fue transado por cada medio de pago:

In [10]:
dataset.groupby(["Payment_Type"])["Price"].sum()

Payment_Type
Amex          188900
Diners        133800
Mastercard    458450
Visa          849350
Name: Price, dtype: int64

#### Propuesto: ¿Cuál fue el producto más vendido dentro de Estados Unidos?

In [11]:
# Escribe tu solución aquí

El retorno de la celda anterior debería verse más o menos así:

Product
Product1     400
Product2      55
Product3       7
Product3       1
Name: Transaction_date, dtype: int64

### Agregando información al dataset

Queremos agregar una columna que indique cuán satisfecho quedó el cliente con su transacción. La medida de satisfacción que utilizaremos será una nota de 1 a 5. Primero definimos una función que entregue $n$ *ratings* aleatorios.

In [12]:
import random

def random_ratings(number):
    ratings = []
    for i in range(number):
        rating = random.choice(range(1,6))
        ratings.append(rating)
    return ratings

Ahora agregamos la columna de ratings de la siguiente manera:

In [13]:
ratings = random_ratings(len(dataset))
dataset["Rating"] = ratings

Revisemos si efectivamente se añadió la columna:

In [14]:
dataset.sample(5)

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude,Rating
329,1/2/09 15:18,Product1,1200,Diners,Brenda,Saffron Walden,England,United Kingdom,9/1/04 2:08,1/28/09 1:26,52.016667,0.250000,4
622,1/22/09 18:07,Product1,1200,Visa,Ryan,Simpsonville,SC,United States,1/6/09 16:59,2/10/09 15:30,34.736940,-82.254440,1
930,1/2/09 7:30,Product1,1200,Mastercard,Fiona,Lake Ronkonkoma,NY,United States,10/27/08 0:00,2/26/09 6:14,40.835000,-73.131670,5
188,1/3/09 10:52,Product1,1200,Visa,Djeiny,Rockville,MD,United States,4/18/05 9:27,1/20/09 6:47,39.018060,-77.208890,4
761,1/7/09 13:38,Product1,1200,Mastercard,Mary,Stuttgart,Baden-Wurttemberg,Germany,1/6/09 13:40,2/17/09 9:32,48.766667,9.183333,1

Imaginemos que queremos cambiar los números de rating 1-5 a algo más descriptivo:

- 1: Very Dissatisfied.
- 2: Somewhat Dissatisfied.
- 3: Neither Satisfied Nor Dissatisfied.
- 4: Somewhat Satisfied.
- 5: Very Satisfied.

¿Cómo lo hacemos? El método `apply` nos ayudará mucho.

En primer lugar, conviene definir una función que dado un *rating* numérico, retorne la medida de satisfacción en palabras:

In [15]:
def convert(rating):
    if rating == 1:
        return "Very Dissatisfied"
    elif rating == 2:
        return "Somewhat Dissatisfied"
    elif rating == 3:
        return "Neither Satisfied Nor Dissatisfied"
    elif rating == 4:
        return "Somewhat Satisfied"
    else:
        return "Very Satisfied"

Posteriormente, aplicamos la función a la columna *Ratings*:

In [16]:
dataset["Rating"] = dataset["Rating"].apply(convert)

Veamos cómo quedó el dataset:

In [17]:
dataset.head()

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude,Rating
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500000,-1.116667,Neither Satisfied Nor Dissatisfied
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195000,-94.681940,Neither Satisfied Nor Dissatisfied
2,1/2/09 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,1/1/09 16:21,1/3/09 12:32,46.188060,-123.830000,Very Dissatisfied
3,1/3/09 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia,9/25/05 21:13,1/3/09 14:22,-36.133333,144.750000,Neither Satisfied Nor Dissatisfied
4,1/4/09 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States,11/15/08 15:47,1/4/09 12:45,33.520560,-86.802500,Neither Satisfied Nor Dissatisfied

Esto ha sido solo una pequeña introducción a pandas. Es muy posible que en tu tarea debas emplear algunas cosas que no vimos en esta ayudantía, por lo que deberás investigar por tu cuenta. Recuerda que ante cualquier duda, los ayudantes estamos a tu completa disposición.